Catalogs/АР_ШаблоныАгентскихДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ШаблоныАгентскихДоговоров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыАренды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорДДУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ШаблоныАгентскихДоговоров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбъектыАрендыОбъектАрендыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОбъекты = Новый Структура;
	ПараметрыОбъекты.Вставить("ИК",Объект.ИК);
	ПараметрыОбъекты.Вставить("ТекущееЗначение",ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды);
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ОбъектыАренды.ФормаВыбора", ПараметрыОбъекты, Элемент);
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОбъектАренды;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыАрендыОбъектАрендыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОбъектыАренды.ТекущиеДанные;
	ЗаполнитьТЧ(ТекущиеДанные.НомерСтроки,ТекущиеДанные.ОбъектАренды);
	
КонецПроцедуры

Процедура ЗаполнитьТЧ(НомерСтроки,ОбъектАренды)
	
	Стр = Объект.ОбъектыАренды[НомерСтроки-1];
	
	Стр.Площадь = Стр.ОбъектАренды.ЗначениеХарактеристики;
	
	Стр.ДоговорДДУ = Стр.ОбъектАренды.ДоговорДДУ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДоговора(Команда)
	
	ТабДок = ПечатьДоговорБС68();
	
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПечатьДоговорБС68()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	Макет = Справочники.АР_ШаблоныАгентскихДоговоров.ПолучитьМакет("ДоговорБС68");
	Обл = Макет.ПолучитьОбласть("БС68");
	
	Док = Объект.Ссылка;
		
	Обл.Параметры.НомерДоговора = Док.НомерДоговора;
		
	ППФ = ПодготовитьПараметрыПечатнойФормы(Док);
	ЗаполнитьЗначенияСвойств(Обл.Параметры, ППФ);
		
	ДанныеПомещений = ""; ДоговораДДУ = "";
	Для Каждого Стр Из Док.ОбъектыАренды Цикл
			
		ДоговораДДУ = ДоговораДДУ + ?(ДоговораДДУ="","",",");
		ДанныеПомещений = ДанныеПомещений + ?(ДанныеПомещений="","",",
		|");
			
		ДанныеПомещений = ДанныеПомещений + "помещение №" + Стр.ОбъектАренды.Наименование;
		
		ЭтажНеНайден = Истина; Этаж = ""; Родитель = Стр.ОбъектАренды.Родитель;
		Пока ЭтажНеНайден И ЗначениеЗаполнено(Родитель) Цикл
			Если Родитель.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.Этаж Тогда
				ЭтажНеНайден = Ложь; Этаж = Родитель.Наименование;
			КонецЕсли;
			Родитель = Родитель.Родитель;
		КонецЦикла;
		Этаж = СтрЗаменить(Этаж, "таж","");
		Этаж = СтрЗаменить(Этаж, "Э","");
		Этаж = СтрЗаменить(Этаж, "э","");
		Этаж = СокрЛП(Этаж);
		Если Этаж <> "" Тогда ДанныеПомещений = ДанныеПомещений + " на " + Этаж + " этаже Здания"; КонецЕсли;
		ДанныеПомещений = ДанныеПомещений + " (далее - «Помещение») на основании Договора участия в долевом строительстве №"
		+ ?(Стр.ДоговорДДУ.Номер = "","___________", Стр.ДоговорДДУ.Номер)
		+ " от " + ?(ЗначениеЗаполнено(Стр.ДоговорДДУ.Дата), Формат(Стр.ДоговорДДУ.Дата, "ДЛФ=ДД"), "_____________");
		
		ДоговораДДУ = ДоговораДДУ + "Договор участия в долевом строительстве №" 
		+ ?(Стр.ДоговорДДУ.Номер = "","___________", Стр.ДоговорДДУ.Номер)
		+ " от " + ?(ЗначениеЗаполнено(Стр.ДоговорДДУ.Дата), Формат(Стр.ДоговорДДУ.Дата, "ДЛФ=ДД"), "_____________");
			
	КонецЦикла;
	
	Если ДанныеПомещений = "" Тогда
		ДанныеПомещений = "помещение №____, на ____ этаже Здания (далее – «Помещение») на основании Договора участия в долевом строительстве №_____ от ________";
	КонецЕсли;
	Если ДоговораДДУ = "" Тогда
		ДоговораДДУ = "Договор участия в долевом строительстве № _____ от «___»_______года";
	КонецЕсли;
		
	Обл.Параметры.ДанныеПомещений = ДанныеПомещений + ".";
	Обл.Параметры.ДоговораДДУ = ДоговораДДУ;
		
	Запрос = Новый Запрос("Выбрать Первые 1 Док.ПечатьУправляющий, Док.ПечатьДоверенность Из Документ.АР17_УстановкаПараметровИК КАК Док Где Док.Проведен И Док.ИКСсылка = &ИК");
	Запрос.УстановитьПараметр("ИК", Док.ИК);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Обл.Параметры.ПоДоверенности = ?(Найти(НРег(Рез.ПечатьДоверенность),"по доверенности")>0,Рез.ПечатьДоверенность,"");
		Обл.Параметры.ПодписантУК = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Рез.ПечатьУправляющий.Наименование);
		Обл.Параметры.АрендаторШапка = Обл.Параметры.АрендаторШапка 
		+ СклонениеПредставленийОбъектов.ПросклонятьФИО(Рез.ПечатьУправляющий.Наименование, 2,,?(Рез.ПечатьУправляющий.ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской,1,2)) + " действующего на основании " + Рез.ПечатьДоверенность;
	Иначе
		Обл.Параметр.АрендаторШапка = Обл.Параметр.АрендаторШапка + Обл.Параметры.ПодписантУК;
	КонецЕсли;
			
	ТабличныйДокумент.Вывести(Обл);
		
	Возврат ТабличныйДокумент;

КонецФункции

&НаСервере
Функция ПодготовитьПараметрыПечатнойФормы(Док)
	
	ППФ = Новый Структура;
	ППФ.Вставить("НомерДоговора", СокрЛП(Док.НомерДоговора));
	ППФ.Вставить("ДатаДоговора", Формат(Док.ДатаДоговора, "ДЛФ=ДД"));
	ППФ.Вставить("АрендодательШапка", "");
	ППФ.Вставить("АрендаторШапка", "");
	ППФ.Вставить("АрендодательПодвал", "");
	ППФ.Вставить("АрендаторПодвал", );
	ППФ.Вставить("ЭлектроннаяПочта", "");
	ППФ.Вставить("УК", Док.Организация.Наименование);
	ППФ.Вставить("ПодписантУК", "");
	
	Если ЗначениеЗаполнено(Док.Контрагент.ОсновноеКонтактноеЛицо) Тогда
		Подписант = Док.Контрагент.ОсновноеКонтактноеЛицо.Фамилия + " " + Лев(Док.Контрагент.ОсновноеКонтактноеЛицо.Имя, 1) + "." + Лев(Док.Контрагент.ОсновноеКонтактноеЛицо.Отчество,1) + ".";
		ППФ.Вставить("Подписант", Подписант);
	КонецЕсли;
	
	// АрендаторШапка
	Руководители = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Док.Организация, Док.ДатаДоговора,);
	ППФ.АрендаторШапка = Док.Организация.НаименованиеПолное + ", ИНН/КПП" + Док.Организация.ИНН + "/" + Док.Организация.КПП + ", ОГРН " + Док.Организация.ОГРН
	+ ", в лице управляющего ";// + Руководители.РуководительПредставление;
	ППФ.ПодписантУК = Руководители.РуководительПредставление;
	
	АрендодательАдрес = "";
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Поиск = Док.Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		АрендодательАдрес = Поиск[0].Представление;
	КонецЕсли;
	
	// АрендодательШапка
	Если Док.Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		ППФ.АрендодательШапка = ?(ЗначениеЗаполнено(Док.Контрагент.РегистрационныйНомер), "", "Гражданин(ка) РФ ") + Док.Контрагент.НаименованиеПолное 
		+ ?(ЗначениеЗаполнено(Док.Контрагент.РегистрационныйНомер), ", имеющий основной государственный регистрационный номер (ОГРНИП) " 
		+ Док.Контрагент.РегистрационныйНомер + ",  ИНН " + Док.Контрагент.ИНН, "") 
		//+ ", пол: _______________, дата рождения: _______________г., место рождения: ________________, "
		+ " " + Док.Контрагент.ДокументУдостоверяющийЛичность;
		Если АрендодательАдрес <> "" Тогда
			ППФ.АрендодательШапка = ППФ.АрендодательШапка + ", зарегистрирован по адресу: " + АрендодательАдрес + ", ";
		КонецЕсли;
			
	Иначе
			
		ППФ.АрендодательШапка = Док.Контрагент.НаименованиеПолное
		+ ", имеющее основной государственный регистрационный номер (ОГРН) " + Док.Контрагент.РегистрационныйНомер
		+ ", ИНН " + Док.Контрагент.ИНН
		+ ", КПП " + Док.Контрагент.КПП
		+ ", место нахождения: _______, __________________________________, в лице ______________________, действующего на основании ________________, ";	
		
	КонецЕсли;
	
	// АрендаторПодвал
	ППФ.АрендаторПодвал = Док.Организация.НаименованиеПолное;
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	Поиск = Док.Организация.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		
		ППФ.АрендаторПодвал = ППФ.АрендаторПодвал + "
		|" + Поиск[0].Представление;
		
	КонецЕсли;
	ППФ.АрендаторПодвал = ППФ.АрендаторПодвал + "
	|ОГРН " + Док.Организация.ОГРН + "
	|ИНН/КПП " + Док.Организация.ИНН + "/" + Док.Организация.КПП + "
	//|Р/с " + Док.Организация.ОсновнойБанковскийСчет.НомерСчета + "
	//|" + Док.Организация.ОсновнойБанковскийСчет.Банк.Наименование + "
	//|К/с " + Док.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет + "
	//|БИК " + Док.Организация.ОсновнойБанковскийСчет.Банк.Код + "
	|Р/с " + Док.РасчетныйСчет.НомерСчета + " 
	|" + Док.РасчетныйСчет.Банк.Наименование + "
	|К/с " + Док.РасчетныйСчет.Банк.КоррСчет + "
	|БИК " + Док.РасчетныйСчет.Банк.Код + "
	|ОКПО " + Док.Организация.КодПоОКПО;
	
	// АрендодательПодвал
	ППФ.АрендодательПодвал = Док.Контрагент.НаименованиеПолное + "
	|" + Док.Контрагент.ДокументУдостоверяющийЛичность;
	Если АрендодательАдрес <> "" Тогда
		ППФ.АрендодательПодвал = ППФ.АрендодательПодвал + "
		|Адрес: " + АрендодательАдрес;
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
	Поиск = Док.Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		ППФ.АрендодательПодвал = ППФ.АрендодательПодвал + "
		|Эл. Адрес " + Поиск[0].Представление;
		
		ППФ.ЭлектроннаяПочта = Поиск[0].Представление;
		
	Иначе
		
		ППФ.ЭлектроннаяПочта = "_________________";
		
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Поиск = Док.Контрагент.КонтактнаяИнформация.НайтиСтроки(Отбор);
	Если Поиск.Количество() > 0 Тогда
		ППФ.АрендодательПодвал = ППФ.АрендодательПодвал + "
		|Конт. телефон " + Поиск[0].Представление;
	КонецЕсли;
	
	Возврат ППФ;
	
КонецФункции
